Revit 2027 API
NumberingFormatSettings.SetParameter Method
 Set parameter incorporated into the numeric label. Parameter to be added into the label The position where the parameter to be added
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetParameter(
	NumberingFormattedParameter formattingParameter,
	int index
)
Public Sub SetParameter (
	formattingParameter As NumberingFormattedParameter,
	index As Integer
)
public:
void SetParameter(
	NumberingFormattedParameter^ formattingParameter,
	int index
)
member SetParameter :
        formattingParameter : NumberingFormattedParameter *
        index : int -> unit
Parameters
formattingParameter NumberingFormattedParameter
index Int32
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  index must be in range between 0 and NumberOfParameters, including margins
See Also
Reference
NumberingFormatSettings Class
Autodesk.Revit.DB Namespace